{"class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "dtype": "float32", "name": "lambda_9", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-11-afda60c76691>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_41", "filters": 24, "padding": "valid", "activation": "linear", "bias_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [2, 2], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_73"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_42", "filters": 36, "padding": "valid", "activation": "linear", "bias_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [2, 2], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_74"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_43", "filters": 48, "padding": "valid", "activation": "linear", "bias_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [2, 2], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_75"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_44", "filters": 64, "padding": "valid", "activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_76"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_45", "filters": 64, "padding": "valid", "activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_77"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_9"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "dense_41", "units": 1164, "activation": "linear", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_78"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "dense_42", "units": 100, "activation": "linear", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_79"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "dense_43", "units": 50, "activation": "linear", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_80"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "dense_44", "units": 10, "activation": "linear", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_81"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "dense_45", "units": 1, "activation": "linear", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}