{"config": [{"config": {"output_shape": null, "trainable": true, "dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-afda60c76691>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_2", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"filters": 24, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "name": "conv2d_6", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"filters": 36, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "name": "conv2d_7", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "elu_11", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"filters": 48, "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "name": "conv2d_8", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "name": "conv2d_9", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "elu_13", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "name": "conv2d_10", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "elu_14", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_6", "units": 1164, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_15", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_7", "units": 100, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_16", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_8", "units": 50, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_17", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_9", "units": 10, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_18", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_10", "units": 1, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}