{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "trainable": true, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-2-e2c4db912c75>\u00da\b<lambda>f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "name": "lambda_5"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "init": "he_normal", "trainable": true, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_21", "nb_filter": 24, "activation": "linear", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_37"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "init": "he_normal", "trainable": true, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_22", "nb_filter": 36, "activation": "linear", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_38"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "init": "he_normal", "trainable": true, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_23", "nb_filter": 48, "activation": "linear", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_39"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "init": "he_normal", "trainable": true, "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_24", "nb_filter": 64, "activation": "linear", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_40"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "init": "he_normal", "trainable": true, "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_25", "nb_filter": 64, "activation": "linear", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_41"}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "input_dim": 1152, "init": "he_normal", "trainable": true, "name": "dense_21", "activation": "linear", "output_dim": 1164, "bias": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_17"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_42"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "input_dim": 1164, "init": "he_normal", "trainable": true, "name": "dense_22", "activation": "linear", "output_dim": 100, "bias": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_18"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_43"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "input_dim": 100, "init": "he_normal", "trainable": true, "name": "dense_23", "activation": "linear", "output_dim": 50, "bias": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_19"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_44"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "input_dim": 50, "init": "he_normal", "trainable": true, "name": "dense_24", "activation": "linear", "output_dim": 10, "bias": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_20"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_45"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "input_dim": 10, "init": "he_normal", "trainable": true, "name": "dense_25", "activation": "linear", "output_dim": 1, "bias": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null}}]}