{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_7", "arguments": {}, "output_shape": null, "output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-30-90c39bb3da35>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 5, "nb_filter": 24, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_31", "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "activation": "linear", "nb_row": 5}}, {"class_name": "ELU", "config": {"name": "elu_55", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 5, "nb_filter": 36, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_32", "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "activation": "linear", "nb_row": 5}}, {"class_name": "ELU", "config": {"name": "elu_56", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 5, "nb_filter": 48, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_33", "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "activation": "linear", "nb_row": 5}}, {"class_name": "ELU", "config": {"name": "elu_57", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_34", "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "subsample": [1, 1], "activation": "linear", "nb_row": 3}}, {"class_name": "ELU", "config": {"name": "elu_58", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "init": "he_normal", "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_35", "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "subsample": [1, 1], "activation": "linear", "nb_row": 3}}, {"class_name": "ELU", "config": {"name": "elu_59", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "he_normal", "W_regularizer": null, "trainable": true, "input_dim": 1152, "name": "dense_31", "b_constraint": null, "bias": true, "output_dim": 1164, "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_60", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "he_normal", "W_regularizer": null, "trainable": true, "input_dim": 1164, "name": "dense_32", "b_constraint": null, "bias": true, "output_dim": 100, "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_61", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "he_normal", "W_regularizer": null, "trainable": true, "input_dim": 100, "name": "dense_33", "b_constraint": null, "bias": true, "output_dim": 50, "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_62", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "he_normal", "W_regularizer": null, "trainable": true, "input_dim": 50, "name": "dense_34", "b_constraint": null, "bias": true, "output_dim": 10, "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_63", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "he_normal", "W_regularizer": null, "trainable": true, "input_dim": 10, "name": "dense_35", "b_constraint": null, "bias": true, "output_dim": 1, "b_regularizer": null, "activation": "linear"}}], "keras_version": "1.2.0"}