{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "output_shape": null, "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-90c39bb3da35>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "activation": "linear", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "W_constraint": null, "subsample": [2, 2], "nb_filter": 24, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "activation": "linear", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "W_constraint": null, "subsample": [2, 2], "nb_filter": 36, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "activation": "linear", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "W_constraint": null, "subsample": [2, 2], "nb_filter": 48, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "activation": "linear", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "activation": "linear", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "he_normal", "output_dim": 1164, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 1152, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "he_normal", "output_dim": 100, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 1164, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "he_normal", "output_dim": 50, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 100, "name": "dense_3", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "he_normal", "output_dim": 10, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 50, "name": "dense_4", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "he_normal", "output_dim": 1, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 10, "name": "dense_5", "activity_regularizer": null}}]}